/*
 * timer.c
 *
 *  Created on: 2023年3月28日
 *      Author: wzl
 */

#include "icm20602_data_handle.h"
#include "voltage_sampling.h"
#include "Buzzer/buzzer.h"
#include "car_control.h"
#include "timer/timer.h"
#include "motor/motor.h"
#include "servo/servo.h"
#include "isr_config.h"
#include "uart/uart.h"
#include "INA226.h"


//-------------------------------------------------------------------------------------------------------------------
// 函数简介       定时中断初始化
// 参数说明       void
// 返回参数       void
//-------------------------------------------------------------------------------------------------------------------
void timer_Init(void)
{
    //开启定时器计数中断,使用CCU61_CH0 ，定时1ms
    pit_ms_init(CCU61_CH0, 1);
    //开启定时器计数中断,使用CCU60_CH1 ，定时500us
    pit_us_init(CCU60_CH1, 500);
}


//-------------------------------------------------------------------------------------------------------------------
// 函数简介       定时器cc61_pit_ch0中断
// 参数说明       void
// 返回参数       void
//-------------------------------------------------------------------------------------------------------------------
static void ccu61_ch0_timer_interrupt(void)
{
    //eb通讯掉线检测
    USB_Edgeboard_Timr();
    //无线发送线程
    Wireless_Timer();
    //蜂鸣器外设线程
    Buzzer_Timer();
    //智能车综合处理线程计数器
    ICAR_Timer();
    //电压采样线程
    adc_Timer();
    //姿态角解算线程
    icm20602_attitude_Angle_Timer();
}


//-------------------------------------------------------------------------------------------------------------------
// 函数简介       定时器cc60_pit_ch1中断
// 参数说明       void
// 返回参数       void
//-------------------------------------------------------------------------------------------------------------------
static void ccu60_ch1_timer_interrupt(void)
{
    //电机电流采样线程
    INA226_Timer();
    //电机控制线程
    motor_ControlLoop();
}


//-------------------------------------------------------------------------------------------------------------------
// 函数简介       定时器cc61_pit_ch0中断函数向量接口
// 参数说明       void
// 返回参数       void
//-------------------------------------------------------------------------------------------------------------------
IFX_INTERRUPT(cc61_pit_ch0_isr, 0, CCU6_1_CH0_ISR_PRIORITY)
{
    //开启中断嵌套
    interrupt_global_enable(0);
    pit_clear_flag(CCU61_CH0);
    //中断服务函数
    ccu61_ch0_timer_interrupt();
}


//-------------------------------------------------------------------------------------------------------------------
// 函数简介       定时器cc60_pit_ch1中断函数向量接口
// 参数说明       void
// 返回参数       void
//-------------------------------------------------------------------------------------------------------------------
IFX_INTERRUPT(cc60_pit_ch1_isr, 0, CCU6_0_CH1_ISR_PRIORITY)
{
    // 开启中断嵌套
    interrupt_global_enable(0);
    pit_clear_flag(CCU60_CH1);
    //中断服务函数
    ccu60_ch1_timer_interrupt();
}
