#ifndef _zf_driver_timer_h_
#define _zf_driver_timer_h_

#include "zf_common_typedef.h"

//====================================================定时器 基础函数====================================================
void    system_start     (void);                                    // 定时器启动
uint32  system_getval    (void);                                    // 定时器计数值获取
//====================================================定时器 基础函数====================================================

//====================================================定时器 扩展函数====================================================
#define system_getval_ms()          (system_getval() / 100000)      // 获取当前计时时间  单位ms
#define system_getval_us()          (system_getval() / 100   )      // 获取当前计时时间  单位us
#define system_getval_ns()          (system_getval() * 10    )      // 获取当前计时时间  单位ns
//====================================================定时器 扩展函数====================================================

#endif
